In [4]:
import pandas as pd

# Series

In [5]:
odd=[1,3,5,7,9]

In [6]:
pd_odd=pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

series는 list와 유사하다. 근데 왜 굳이 series를 사용하냐????  
pandas의 기능을 사용하기 위해서이다!  
예를 들면 odd.mean()은 오류!, 그러나 pd_odd.mean()은 사용 가능!

In [7]:
pd_odd.mean()

5.0

# DataFrame 엑셀이나 구글 스프레스시트라고 생각하면 됨

In [8]:
numbers=[
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

In [9]:
numbers

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [11]:
pd_numbers=pd.DataFrame(numbers)
pd_numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
# column 가져오기
pd_numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [270]:
type(pd_numbers[0])

pandas.core.series.Series

In [271]:
type(pd_numbers)

pandas.core.frame.DataFrame

위의 자료를 보듯이 DataFrame은 Series로 이루어져 있다라고 생각하면 됨

In [272]:
# 0번째 행 가져오는 것
pd_numbers.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [273]:
type(pd_numbers.loc[0])

pandas.core.series.Series

이것또한 Series이다

# Data type

In [274]:
odd=[1,3,5,7,9]

odd=pd.Series(odd)

# pandas Series 안의 데이터 타입이 궁금할 때 
odd.dtypes

dtype('int64')

In [275]:
odd=[1,3,5,7.0,9]

odd=pd.Series(odd)

odd.dtypes

dtype('float64')

실수가 정수를 포함하기 때문에 float라는 dtype으로 표현

In [276]:
odd=[1,3,5,7.0,9,"kiwon"]

odd=pd.Series(odd)

# o==object==string==str
odd.dtypes

dtype('O')

즉, 정수 < 실수 < 문자

# NaN (Not a Number)

In [277]:
import numpy as np
odd=[1,np.nan,5,7,9]

odd=pd.Series(odd)

odd.dtypes

dtype('float64')

pandas에서 NaN값은 비어있는 값이고 dtype은 float이다

In [278]:
odd.mean()

5.5

mean 값을 구할 때 보시다시피 nan값을 제외하고 평균을 구한다

In [279]:
np.nan

nan

In [280]:
# nan 끼리는 서로 비교할 수 없어
np.nan==np.nan

False

In [281]:
value=np.nan

# isnull --> 비어있으면 True, 안비어있으면 False
pd.isnull(value)

True

In [282]:
# notnull --> 안비어있으면 True, 비어있으면 False
pd.notnull(value)

False

# DataFrame

## 생성하기

In [180]:
# 2개를 조합해서 DataFrame 생성

order=[
    ['2020-06-01',500,'confirmed'],
    ['2020-06-03',700,'confirmed'],
    ['2020-06-05',300,'canceled']
]
columns=['Date','price','state']

order=pd.DataFrame(order,columns=columns)

order

         Date  price      state
0  2020-06-01    500  confirmed
1  2020-06-03    700  confirmed
2  2020-06-05    300   canceled

In [181]:
# dict을 사용해서 DataFrame 생성

order={
    'Date':['2020-06-01','2020-06-03','2020-06-05'],
    'amount':[500,700,300],
    'state':['confirmed','confirmed','canceled']
}

order=pd.DataFrame(order)

order

         Date  amount      state
0  2020-06-01     500  confirmed
1  2020-06-03     700  confirmed
2  2020-06-05     300   canceled

In [182]:
# 이번엔 list 안에 dict을 넣어서 DataFrame 생성

order=[
    {'Date':'2020-06-01','amount':500,'state':'confirmed'},
    {'Date':'2020-06-03','amount':700,'state':'confirmed'},
    {'Date':'2020-06-05','amount':300,'state':'canceled'}
]

order=pd.DataFrame(order)

order

         Date  amount      state
0  2020-06-01     500  confirmed
1  2020-06-03     700  confirmed
2  2020-06-05     300   canceled

In [4]:
order_url='https://bit.ly/dsa-01-order'

order=pd.read_csv(order_url)

order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

In [284]:
# 방법1 unique 한 값인 id를 인덱스로 해서 data 생성 
order=pd.read_csv(order_url,index_col='id')

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [285]:
# 방법12unique 한 값인 id를 인덱스로 해서 data 생성 
order=pd.read_csv(order_url)

order=order.set_index('id')

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [286]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [287]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [288]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [289]:
# column 명 바꾸기
order.columns=['user_id','product_id','date','amount','address','status']
order

    user_id  product_id        date  amount  address     status
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

# 기본 연산

In [190]:
order['amount'].mean()

585.7142857142857

In [191]:
order['amount'].min()

200

In [192]:
order['amount'].max()

900

In [193]:
order['amount'].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

In [194]:
# unique 값 찾기
order['status'].unique()

array(['confirmed', 'canceled'], dtype=object)

In [195]:
# unique 값의 개수까지 찾기
order['status'].value_counts()

confirmed    4
canceled     3
Name: status, dtype: int64

In [196]:
# unique 값의 비율
order['status'].value_counts(normalize=True)

confirmed    0.571429
canceled     0.428571
Name: status, dtype: float64

In [290]:
# replace.().replace() 2번 연속해서 사용해도 된다
order['status'].replace('canceled','cancel').replace('canceled','cancel')

order

    user_id  product_id        date  amount  address     status
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

뭐지!? 분명히 위에서 replace로 바꿔줬는데 order 데이터프레임이 바뀌지 않았다!!

In [291]:
order['status']=order['status'].replace('confirmed','confirm').replace('canceled','cancel')

order

    user_id  product_id        date  amount  address   status
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

위와 같이 바꾸는 column을 명시적으로 표현을 해줘야 변경이 된다.

In [199]:
order['date']

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
6    2017-01-09
7    2017-01-10
Name: date, dtype: object

In [292]:
from datetime import datetime

# order['date'] =  pd.to_datetime(order['date'], format='%Y/%m/%d')
order['date'] =  pd.to_datetime(order['date'])
order['date']

id
1   2017-01-01
2   2017-01-03
3   2017-01-03
4   2017-01-07
5   2017-01-09
6   2017-01-09
7   2017-01-10
Name: date, dtype: datetime64[ns]

In [201]:
order['date'].dt.month

id
1    1
2    1
3    1
4    1
5    1
6    1
7    1
Name: date, dtype: int64

# 행렬 검색하기

In [202]:
# 행렬 여러개 검색 방법1

order[['date','amount']]

         date  amount
id
1  2017-01-01     500
2  2017-01-03     700
3  2017-01-03     900
4  2017-01-07     500
5  2017-01-09     700
6  2017-01-09     600
7  2017-01-10     200

In [203]:
# 행렬 여러개 검색 방법2

column=['user_id','date','amount']
order[column]

    user_id       date  amount
id
1         3 2017-01-01     500
2         1 2017-01-03     700
3         3 2017-01-03     900
4         4 2017-01-07     500
5         7 2017-01-09     700
6         5 2017-01-09     600
7         2 2017-01-10     200

In [204]:
# loc==locate  ex)loc[1] => index가 1인 놈을 불러오는 것

order.loc[1]

user_id                         3
product_id                      9
date          2017-01-01 00:00:00
amount                        500
address                     Seoul
status                    confirm
Name: 1, dtype: object

In [205]:
order.loc[[1,3,6]]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [206]:
# list 로 불러오기
order_ids=[1,3,6]

order.loc[order_ids]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [207]:
order.loc[2:5]

    user_id  product_id       date  amount  address   status
id
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm

In [208]:
order.loc[1]['date']

Timestamp('2017-01-01 00:00:00')

In [209]:
order.loc[1,'date']

Timestamp('2017-01-01 00:00:00')

order.loc[1]['date'], order.loc[1,'date']  

결과 값은 같지만 전자의 경우는 2번 열고 닫으므로 비효율적이다. 후자를 권장  
  
  즉, order.loc[index, column] 으로 작성할 것.

# 색인

In [210]:
order['date']=='2017-01-03'

id
1    False
2     True
3     True
4    False
5    False
6    False
7    False
Name: date, dtype: bool

In [211]:
# 1월 3일인 데이터 색인
order[order['date']=='2017-01-03']

    user_id  product_id       date  amount  address   status
id
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm

In [212]:
# 1월 3일 아닌 데이터 색인
order[order['date']!='2017-01-03']

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [213]:
# amount 500 이상인 데이터 색인
order[order['amount']>=500]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [214]:
# isin 은 조건 중 있는지 없는지 찾을 수 있는 방법

date_candidates=['2017-01-01','2017-01-05','2017-01-09']

order[order['date'].isin(date_candidates)]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [215]:
# isnull은 조건 중 NaN 값이 있는지 찾을 수 있는 방법

order[order['address'].isnull()]

    user_id  product_id       date  amount address  status
id
4         4           2 2017-01-07     500     NaN  cancel
7         2           5 2017-01-10     200     NaN  cancel

이렇게 다 order[] 로 감싸주면 바로 그 row들이 나온다!

In [293]:
# notnull은 조건 중 nan 값이 아닌 것을 찾을 수 있는 방법

order[order['address'].notnull()]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [217]:
order[~order['address'].isnull()]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

보시다시피 ~ + isnull 은 notnull 과 같은 결과 값을 보여줌.  
~ 은 어디서나 사용가능하다.

In [294]:
# 다중조건 인덱싱
order[(order['amount']>=500) & (order['status']=='confirm')]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm

조건은 ()로 묶어줘야 할 것!!  
why???? --> &를 먼저 계산해버리기 때문에 ()로 묶어버리는 것이다

In [219]:
high= (order['amount']>=500)
confirm= (order['status']=='confirm')

order[high&confirm]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm

하지만, 조건이 많아질 경우에는 가로로 길어질 수 있으므로 위의 방식처러 변수로 설정해 진행할 수 있다.

In [220]:
# | (or) 둘 중 한개의 조건이라도 참이면 참

order[high|confirm]

    user_id  product_id       date  amount  address   status
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

# 색인 후 검색

In [221]:
order[order['date'].isin(date_candidates)]['date']

id
1   2017-01-01
5   2017-01-09
6   2017-01-09
Name: date, dtype: datetime64[ns]

이처럼 뒤에 [] 코드만 붙여주면 검색 바로 가능

In [222]:
order.loc[order['date'].isin(date_candidates),'date']

id
1   2017-01-01
5   2017-01-09
6   2017-01-09
Name: date, dtype: datetime64[ns]

혹은 이처럼 loc 구문을 사용하고 뒤에 , 를 붙여 검색할 수 있다

In [223]:
order.loc[order['date'].isin(date_candidates),('date','amount','status')]

         date  amount   status
id
1  2017-01-01     500  confirm
5  2017-01-09     700  confirm
6  2017-01-09     600   cancel

### 컬럼 추가하기 & 수정하기

In [295]:
order['card_holder']='KB Card'
order

    user_id  product_id       date  amount  address   status card_holder
id
1         3           9 2017-01-01     500    Seoul  confirm     KB Card
2         1           7 2017-01-03     700    Seoul  confirm     KB Card
3         3           8 2017-01-03     900  Daejeon  confirm     KB Card
4         4           2 2017-01-07     500      NaN   cancel     KB Card
5         7           3 2017-01-09     700  Incheon  confirm     KB Card
6         5           7 2017-01-09     600    Busan   cancel     KB Card
7         2           5 2017-01-10     200      NaN   cancel     KB Card

In [296]:
# order['order']=[1,3,2,4,5,6,7]
order

    user_id  product_id       date  amount  address   status card_holder
id
1         3           9 2017-01-01     500    Seoul  confirm     KB Card
2         1           7 2017-01-03     700    Seoul  confirm     KB Card
3         3           8 2017-01-03     900  Daejeon  confirm     KB Card
4         4           2 2017-01-07     500      NaN   cancel     KB Card
5         7           3 2017-01-09     700  Incheon  confirm     KB Card
6         5           7 2017-01-09     600    Busan   cancel     KB Card
7         2           5 2017-01-10     200      NaN   cancel     KB Card

In [302]:
# 조건으로 해서 자종 데이터 입력

# order['VIP']= ((order['amount']>=500) & (order['status']=='confirm'))
order['state']=(order['amount']<500) | (order['status']=='cancel')
order

,user_id,product_id,date,amount,address,status,card_holder,VIP,state
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB Card,True,False
2,1,7,2017-01-03,700,Seoul,confirm,KB Card,True,False
3,3,8,2017-01-03,900,Daejeon,confirm,KB Card,True,False
4,4,2,2017-01-07,500,NaN,cancel,KB Card,False,True
5,7,3,2017-01-09,700,Incheon,confirm,KB Card,True,False
6,5,7,2017-01-09,600,Busan,cancel,KB Card,False,True
7,2,5,2017-01-10,200,NaN,cancel,KB Card,False,True

In [298]:
order

    user_id  product_id       date  amount  address   status card_holder
id
1         3           9 2017-01-01     500    Seoul  confirm     KB Card
2         1           7 2017-01-03     700    Seoul  confirm     KB Card
3         3           8 2017-01-03     900  Daejeon  confirm     KB Card
4         4           2 2017-01-07     500      NaN   cancel     KB Card
5         7           3 2017-01-09     700  Incheon  confirm     KB Card
6         5           7 2017-01-09     600    Busan   cancel     KB Card
7         2           5 2017-01-10     200      NaN   cancel     KB Card

### 삭제하기

In [257]:
order.drop(['VIP'],axis='columns')
order.drop(3,axis='rows')

,id,user_id,product_id,date,price,address,state,card_holder,order,VIP,status
0,1,3,9,2017-01-01,500,Seoul,confirmed,KB Card,1,True,False
1,2,1,7,2017-01-03,700,Seoul,confirmed,KB Card,3,True,False
2,3,3,8,2017-01-03,900,Daejeon,confirmed,KB Card,2,True,False
4,5,7,3,2017-01-09,700,Incheon,confirmed,KB Card,5,True,False
5,6,5,7,2017-01-09,600,Busan,canceled,KB Card,6,False,False
6,7,2,5,2017-01-10,200,NaN,canceled,KB Card,7,False,False

In [259]:
col_list=['id','user_id']
order=order.drop(col_list,axis="columns")
order

,product_id,date,price,address,state,card_holder,order,VIP,status
0,9,2017-01-01,500,Seoul,confirmed,KB Card,1,True,False
1,7,2017-01-03,700,Seoul,confirmed,KB Card,3,True,False
2,8,2017-01-03,900,Daejeon,confirmed,KB Card,2,True,False
3,2,2017-01-07,500,NaN,canceled,KB Card,4,False,False
4,3,2017-01-09,700,Incheon,confirmed,KB Card,5,True,False
5,7,2017-01-09,600,Busan,canceled,KB Card,6,False,False
6,5,2017-01-10,200,NaN,canceled,KB Card,7,False,False

In [313]:
order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

# apply

In [9]:
def is_vip(x):
    if x >= 500:
        return "vip"
    else:
        return "non_vip"
    
    return x

order['status']=order['price'].apply(is_vip)
order

   id  user_id  product_id        date  price  address      state   status
0   1        3           9  2017-01-01    500    Seoul  confirmed      vip
1   2        1           7  2017-01-03    700    Seoul  confirmed      vip
2   3        3           8  2017-01-03    900  Daejeon  confirmed      vip
3   4        4           2  2017-01-07    500      NaN   canceled      vip
4   5        7           3  2017-01-09    700  Incheon  confirmed      vip
5   6        5           7  2017-01-09    600    Busan   canceled      vip
6   7        2           5  2017-01-10    200      NaN   canceled  non_vip

In [320]:
def is_vip(row):
    amount=row["price"]
    state=row["state"]
    
    if amount>=500 and state=="confirmed":
        return "VIP"
    else:
        return "None_VIP"
    
order['status']=order.apply(is_vip,axis="columns")
order

   id  user_id  product_id        date  price  address      state    status
0   1        3           9  2017-01-01    500    Seoul  confirmed       VIP
1   2        1           7  2017-01-03    700    Seoul  confirmed       VIP
2   3        3           8  2017-01-03    900  Daejeon  confirmed       VIP
3   4        4           2  2017-01-07    500      NaN   canceled  None_VIP
4   5        7           3  2017-01-09    700  Incheon  confirmed       VIP
5   6        5           7  2017-01-09    600    Busan   canceled  None_VIP
6   7        2           5  2017-01-10    200      NaN   canceled  None_VIP

axis="columns"를 붙이는 이유는 위의 def 함수에서 column이 2개 이상 사용되기 때문이다!